Revit 2026 API

# UIApplicationCreateRibbonPanel(Tab, String) Method

---

Create a new RibbonPanel on the designated standard Revit tab.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual RibbonPanel CreateRibbonPanel(
	Tab tab,
	string panelName
)
```
```vb
Public Overridable Function CreateRibbonPanel (
	tab As Tab,
	panelName As String
) As RibbonPanel
```
```cpp
public:
virtual RibbonPanel^ CreateRibbonPanel(
	Tab tab,
	String^ panelName
)
```
```fsharp
abstract CreateRibbonPanel :
        tab : Tab *
        panelName : string -> RibbonPanel
override CreateRibbonPanel :
        tab : Tab *
        panelName : string -> RibbonPanel
```

#### Parameters

tab Tab
    The target tab, on which the new panel will be created.
panelName String
    The name of the panel to be created.

#### Return Value

RibbonPanel

| Exception | Condition |
| --- | --- |
| ArgumentNullException | panelName is . |
| ArgumentException | panelName is Empty or the tab is not valid. |
| InvalidOperationException | If more than 100 panels were created or the tab cannot be found. |

This method will create a custom panel appending to the specified tab. This method is not supported in Macros.

#### Reference

UIApplication Class

CreateRibbonPanel Overload

Autodesk.Revit.UI Namespace